/**
  *******************************    STM8S9003    *******************************
  * @文件名     ： LCD0802.c
  * @作者       ： 佘晓凯 
  * @库版本     ： 自写库 
  * @文件版本   ： V1.0.0
  * @日期       ： 2019年01月02日  
  * @摘要       ： LCD0802显示模块,不测忙，8线并行
  ******************************************************************************/
/*----------------------------------------------------------------------------
  更新日志:
  2019-01-02 V1.0.0:初始版本 
  ----------------------------------------------------------------------------*/
/* 包含的头文件 --------------------------------------------------------------*/
#include "LCD0802.h"


/* 全局变量 ------------------------------------------------------------------*/



/************************************************
函数名称 ： LcdGpioInit
功    能 ： LCD有关GPIO的初始化 
摘    要 ： PB0-7为数据口,PC2 RS,PC1 RW,PE5 E
			推挽加限流,开漏加上拉
*************************************************/
void LcdGpioInit(void)
{
	//配置为输出模式
	GPIOB->DDR|= 0xFF;		
	GPIOC->DDR|= 0x06;
	GPIOE->DDR|= 0x01<<5;
	
	//配置为推挽模式
	GPIOB->CR1|= 0xFF;
	GPIOC->CR1|= 0x06;
	GPIOE->CR1|= 0x01<<5;
}

/************************************************
函数名称 ： LcdInit
功    能 ： LCD的初始化 
摘    要 ： 无
*************************************************/
void LcdInit(void)
{
	void LcdGpioInit(void);
	
	LcdGpioInit();		//引脚初始化
	
	LCD_DELAY_15ms;
	WrtCmd(0x38);			//设置工作方式，8线，2行，5*8
	LCD_DELAY_5ms;
	WrtCmd(0x38);
	LCD_DELAY_5ms;
	WrtCmd(0x38);
	LCD_DELAY_5ms;
	WrtCmd(0x38);
	LCD_DELAY_5ms;
	WrtCmd(0x38);
	LCD_DELAY_5ms;
	WrtCmd(0x08);			//关闭显示
	LCD_DELAY_5ms;
	WrtCmd(0x06);			//光标右移
	LCD_DELAY_5ms;
	WrtStr(1,0,"Init...");
	LCD_DELAY_5ms;
	WrtCmd(0x0C);			//开显示
	LCD_DELAY_5ms;
}

/************************************************
函数名称 ： WrtCmd
功    能 ： 写入一个字节的命令 
参    数 ： cmd 需要写入的命令 
摘    要 ： 无
*************************************************/
void WrtCmd(u8 cmd)
{
	WRITE;
	CMD;
	LCD_DELAY_20us;
	LCD_DI=cmd;
	LCD_DELAY_20us;
	LCD_ENABLE;	
	LCD_DELAY_20us;
}

/************************************************
函数名称 ： WrtData
功    能 ： 写入一个字节的数据 
参    数 ： _data 需要写入的数据 
摘    要 ： 无
*************************************************/
void WrtData(u8 _data)
{
	WRITE;
	DATA;
	LCD_DELAY_20us;
	LCD_DI=_data;
	LCD_ENABLE;
}

/************************************************
函数名称 ： WrtStr
功    能 ： 在指定位置输出字符串
参    数 ： char *str 需要显示的字符串
			u8 y 行
			u8 x 列
摘    要 ： 无
*************************************************/
void WrtStr(u8 y,u8 x,char *str)
{
	switch(y)
	{
		case 1:WrtCmd(0x80+x);break;
		case 2:WrtCmd(0xC0+x);break;
	}
	for(;*str != 0;str++)
		WrtData(*str);

}


